package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

public class Solution
{
    public static void main(String[] args)
    {
        //System.out.print(" ");
        for(int i=0;i<10;i++)
        System.out.print("8");
      //  for(int j=0;j<10;j++)
      //      System.out.println("8");
        //напишите тут ваш код
    }
}
