package com.javarush.test.level08.lesson11.home03;

import java.util.HashMap;
import java.util.Map;

/* Люди с одинаковыми именами и/или фамилиями
1. Создать словарь Map (<String, String>) и добавить туда 10 человек в виде «Фамилия»-«Имя».
2. Пусть среди этих 10 человек есть люди с одинаковыми именами.
3. Пусть среди этих 10 человек есть люди с одинаковыми фамилиями.
4. Вывести содержимое Map на экран.
*/

public class Solution
{
    public static void main(String[] args)
    {
        Map<String, String> map = createPeopleList();
        printPeopleList(map);
    }

    public static Map<String, String> createPeopleList()
    {
        Map<String,String> map=new HashMap<String, String>();
        map.put("Alex","Leib1");
        map.put("Alex1","Leib");
        map.put("Alex","Leib");
        map.put("Alex2","Leib2");
        map.put("Alex3","Leib3");
        map.put("Alex4","Leib4");
        map.put("Alex5","Leib5");
        map.put("Alex6","Leib7");
        map.put("Alex7","Leib6");
        map.put("Alex","Leib8");
        //напишите тут ваш код

        return map;
    }

    public static void printPeopleList(Map<String, String> map)
    {
        for (Map.Entry<String, String> s : map.entrySet())
        {
            System.out.println(s.getKey() + " " + s.getValue());
        }
    }

}
